In [20]:
import numpy as np
import pandas as pd
index = ['a', 'b', 'c', 'd']
ser2= pd.Series(np.arange(4)*10, index)
ser2

a     0
b    10
c    20
d    30
dtype: int32

In [12]:
ser1 = pd.Series(np.arange(4)*10)
ser1

0     0
1    10
2    20
3    30
dtype: int32

In [21]:
ser2['b' : 'd']                       # label로 slicing하면 '끝점'도 포함한다

b    10
c    20
d    30
dtype: int32

In [22]:
ser2['b' : 'd'] = 5
ser2

a    0
b    5
c    5
d    5
dtype: int32

In [24]:
# 데이터 프레임 만들기
data = np.arange(16).reshape((4,4))
index = ['Ohio', 'Colorado', 'Utah', 'New York']
columns = ['one', 'two', 'three', 'four']
df1 = pd.DataFrame(data, index, columns)
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
df1['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [26]:
df1.two

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [27]:
df1[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [28]:
df1[:2]                                # [:2] => [0~1] 행 출력

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [29]:
df1[df1['three'] >5]                   # df1 데이터프레임에서 columns 'three'의 값이 5보다 큰 행만 출력

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
# loc와 iloc로 선택하기
### 축 이름을 선택 (loc)
df1.loc['Colorado', ['two', 'three']]                 # data.loc("index", "columns")

two      5
three    6
Name: Colorado, dtype: int32

In [32]:
df1.loc['Utah', ['one', 'four']]

one      8
four    11
Name: Utah, dtype: int32

In [34]:
### 정수 색인으로 선택 (iloc)
df1.iloc[0, [3,0,1]]

four    3
one     0
two     1
Name: Ohio, dtype: int32

In [36]:
df1.iloc[1]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [37]:
df1.iloc[[1,2], [3,0,1]]              # [1,2] => index     [3,0,1] => columns

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [40]:
# 산술 연산과 데이터 정렬

s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [41]:
s1+s2                        # 서로 대응되는 색인이 없는 경우, 데이터값은 'NaN'
                             # 산술 연산 시 누락된 값은 전파된다.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [44]:
# 산술 연산 메서드에 채워 넣을 값 지정하기
df1 = pd.DataFrame(np.arange(12).reshape((3,4)), columns = ['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.arange(20).reshape((4,5)), columns = ['a', 'b', 'c', 'd', 'e'])

df2.loc[1, 'b'] = np.nan
print(df1)
print(df2)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [45]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [49]:
df1.add(df2, fill_value = 0)                           # NaN 값을 0으로 채우고 더하기

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
frame = pd.DataFrame()